Revit 2026 API

# FlowDirectionType Enumeration

---

An enumerated type listing direction types for a connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FlowDirectionType
```
```vb
Public Enumeration FlowDirectionType
```
```cpp
public enum class FlowDirectionType
```
```fsharp
type FlowDirectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Bidirectional | 0 | Flow bidirectional |
| In | 1 | Flow in |
| Out | 2 | Flow out |

#### Reference

Autodesk.Revit.DB Namespace